[
{"url": "http://www.technewsworld.com/story/Bezos-Trots-Out-New-Glenn-Rocket-Design-83886.html", "timestamp": "2016-09-14 18:56:43", "image": "http://www.technewsworld.com/article_images/story_graphics_xlarge/xl-2015-bezos-blue-origin-1.jpg", "description": "Jeff Bezos on Monday disclosed details about the New Glenn rockets his Blue Origin aerospace company plans to build. \"Blue Origin's next step ... meet New Glenn,\" he tweeted. Bezos released illustrations of two models, the New Glenn 2 and the larger New Glenn 3. They're larger than all other rockets except the Saturn V, which NASA used for the Apollo program to send astronauts to the moon and other missions.", "title": "Bezos Trots Out New Glenn Rocket Design"},
{"url": "http://www.technewsworld.com/story/Aryaais-Braid-Aims-to-Weave-Together-Neural-Network-Components-83890.html", "timestamp": "2016-09-14 18:56:43", "image": "http://www.technewsworld.com/article_images/story_graphics_xlarge/xl-2016-artificial-intelligence-1.jpg", "description": "Startup Arya.ai on Monday introduced Braid, an open source tool available for free to companies developing neural networks. Braid is a flexible, customizable, modular meta-framework that works with operating systems for deep learning, according to the company. It is designed for rapid development and to support arbitrary network designs. It is simple and scalable, Arya.ai said.", "title": "Arya.ai's Braid Aims to Weave Together Neural Network Components"},
{"url": "http://www.technewsworld.com/story/How-China-Could-Take-Over-the-Worlds-Tech-and-Automotive-Markets-83883.html", "timestamp": "2016-09-14 18:56:43", "image": "http://www.technewsworld.com/article_images/story_graphics_xlarge/xl-2016-china-2.jpg", "description": "Nvidia and Baidu recently made an announcement with regard to self-driving cars that deserves closer attention. China currently is behind the U.S. in automotive technology, but it has passed the U.S. and Japan in automobile production -- I actually thought Japan was still ahead. China is producing twice the number of cars the U.S. is producing right now.", "title": "How China Could Take Over the World's Tech and Automotive Markets"},
{"url": "http://www.technewsworld.com/story/Apple-Puts-Its-User-Friendly-Stamp-on-Fancy-iPhone-7-Cameras-83880.html", "timestamp": "2016-09-14 18:56:43", "image": "http://www.technewsworld.com/article_images/story_graphics_xlarge/xl-2016-iphone7-camera-1.jpg", "description": "Apple raised the ante for cameras in flagship phones with the announcement of its iPhone 7 and iPhone 7 Plus. Others already have taken the dual-camera approach to smartphone photography -- notably HTC, LG and Huawei. \"While it's not the first dual camera mounted in a smartphone, it's on par with the others in terms of basic functionality,\" said Brian Blau, a research director for Gartner.", "title": "Apple Puts Its User-Friendly Stamp on Fancy iPhone 7 Cameras"},
{"url": "http://www.technewsworld.com/story/Sonys-PS4-Pro-Gets-the-Jump-on-4K-HDR-TVs-83879.html", "timestamp": "2016-09-14 18:56:43", "image": "http://www.technewsworld.com/article_images/story_graphics_xlarge/xl-2016-playstation-ps4-pro-1.jpg", "description": "Sony on Wednesday officially unveiled the powered-up PlayStation 4 Pro, which features smoother graphics, thanks to higher frame rates. This new version of Sony's bestselling video game console includes support for 4K resolution and high dynamic range, making it fully compatible with 4K/UHD displays. Some developers will add PS4 Pro support to existing games, as well as upcoming releases.", "title": "Sony's PS4 Pro Gets the Jump on 4K, HDR TVs"},
{"url": "http://www.technewsworld.com/story/Apple-Hopes-iPhone-7-Extras-Will-Make-Up-for-Missing-Headphone-Jack-83875.html", "timestamp": "2016-09-14 18:56:43", "image": "http://www.technewsworld.com/article_images/story_graphics_xlarge/xl-2016-iphone7-7plus-1.jpg", "description": "Apple CEO Tim Cook on Wednesday officially unveiled the iPhone 7 and iPhone Plus, confirming a rumor that has evoked widespread dread: The traditional headphone jacks are gone. The new iPhones are sleeker than their predecessors, though, as well as water resistant. Their biggest plus might be the advanced lenses in what Apple claims is the most sophisticated smartphone camera in the world.", "title": "Apple Hopes iPhone 7 Extras Will Make Up for Missing Headphone Jack"},
{"url": "http://www.technewsworld.com/story/Gadget-Ogling-Smart-Desks-New-Wave-Gaming-and-Roaming-Routers-83862.html", "timestamp": "2016-09-14 18:56:43", "image": "http://www.technewsworld.com/article_images/story_graphics_xlarge/xl-2016-gaze-desk-1.jpg", "description": "After a long, laborious process and a lot of scraping paint splotches from the floor, the office space in my new apartment is ready for me, and I will soon no longer need to write this column from my kitchen table. So, I'm in the market for a desk.\r\nWith my nascent interest in standing desks, the Gaze Desk seems a decent option. It switches between standing and seated modes with a button press.", "title": "Gadget Ogling: Smart Desks, New-Wave Gaming, and Roaming Routers"},
{"url": "http://www.technewsworld.com/story/Obama-Warns-Against-Cyber-Cold-War-83868.html", "timestamp": "2016-09-14 18:56:43", "image": "http://www.technewsworld.com/article_images/story_graphics_xlarge/xl-2016-obama-g20-1.jpg", "description": "President Obama on Monday urged de-escalation of a potential arms race involving cyberweapons. The president's remarks followed his meeting with world leaders, including Russian President Vladimir Putin, at the G20 Summit in Hangzhou, China. The U.S. has more offensive and defensive capability than any other country on Earth, Obama noted. The president urged adoption of new cybersecurity norms.", "title": "Obama Warns Against Cyber Cold War"},
{"url": "http://www.technewsworld.com/story/Dell--EMC-History-Is-Made-83858.html", "timestamp": "2016-09-14 18:56:43", "image": "http://www.technewsworld.com/article_images/story_graphics_xlarge/xl-2015-dell-tucci-1.jpg", "description": "I've been involved in mergers and acquisitions for decades, and I used to run an acquisition cleanup team while at IBM. I've seen so many bad acquisitions that it is generally far easier to point out the good ones. What is somewhat ironic, given my background, is that the best largely have been executed by Dell, using a process initially developed by IBM.", "title": "Dell + EMC: History Is Made"},
{"url": "http://www.technewsworld.com/story/FairWare-Hackers-May-Take-Ransoms-Keep-Stolen-Files-83865.html", "timestamp": "2016-09-14 18:56:43", "image": "http://www.technewsworld.com/article_images/story_graphics_xlarge/xl-2016-hacker-ransomware-1.jpg", "description": "The latest ransomware intrusion that targets Linux servers, dubbed \"FairWare,\" may be a classic server hack designed to bilk money from victims with no intent to return stolen files after payment in bitcoins is made. The attack reportedly targets a Linux server, deletes the Web folder, and then demands a ransom payment of two bitcoins for return of the stolen files.", "title": "FairWare Hackers May Take Ransoms, Keep Stolen Files"},
{"url": "http://www.technewsworld.com/story/Nvidia-Baidu-Team-on-Cloud-to-Car-AI-Platform-83863.html", "timestamp": "2016-09-14 18:56:43", "image": "http://www.technewsworld.com/article_images/story_graphics_xlarge/xl-2016-baidu-nvidia-1.jpg", "description": "Nvidia and Baidu have agreed to collaborate on the incorporation of artificial intelligence in a cloud-to-car autonomous vehicle platform, Nvidia CEO Jen-Hsun Huang said Wednesday. The companies plan to integrate Baidu's cloud platform and mapping technology with Nvidia's self-driving computing platform. They also will work together to create solutions for high-definition maps.", "title": "Nvidia, Baidu Team on Cloud-to-Car AI Platform"},
{"url": "http://www.technewsworld.com/story/Can-Apple-Beat-Snapchat-and-Instagram-at-Their-Video-Game-83861.html", "timestamp": "2016-09-14 18:56:43", "image": "http://www.technewsworld.com/article_images/story_graphics_xlarge/xl-2016-apple-rumor-2.jpg", "description": "Snapchat and Instagram, look out. Apple has you in its sights. The company reportedly is working on a video-sharing app with features similar to those found in Snapchat and Instagram. The app, possibly slated for release in 2017, will allow users of Apple devices to record a video, apply filters and draw on it, then share it with others on a variety of social networks.", "title": "Can Apple Beat Snapchat and Instagram at Their Video Game?"},
{"url": "http://www.technewsworld.com/story/Massive-Data-Breach-Puts-French-Sub-Maker-in-Crosshairs-83860.html", "timestamp": "2016-09-14 18:56:43", "image": "http://www.technewsworld.com/article_images/story_graphics_xlarge/xl-2016-scorpene-sub-1.jpg", "description": "Officials in France and India are investigating a massive data breach involving thousands of documents belonging to defense industry contractor DCNS, which was scheduled to deliver six Scorpene-class submarines to the Indian navy later this year. Hackers stole more than 22,000 pages of documents that included detailed technical information on the vessels, some of which was published online.", "title": "Massive Data Breach Puts French Sub Maker in Crosshairs"},
{"url": "http://www.technewsworld.com/story/Intels-Kaby-Lake-Chip-Promises-Deeper-Internet-Immersion-83857.html", "timestamp": "2016-09-14 18:56:43", "image": "http://www.technewsworld.com/article_images/story_graphics_xlarge/xl-2016-7th-gen-intel-core-processor-1.jpg", "description": "Facing a shrinking market for personal computers and a stalled market for tablets, Intel on Tuesday unveiled its 7th-generation processors, code-named \"Kaby Lake,\" which deliver more speed and power than its 6th-generation chipsets, while improving battery efficiency. Intel has positioned the new Kaby Lake chipsets as ideal for the immersive Internet.", "title": "Intel's Kaby Lake Chip Promises Deeper Internet Immersion"},
{"url": "http://www.technewsworld.com/story/Election-Season-Spawns-Scams-With-Political-Twist-83854.html", "timestamp": "2016-09-14 18:56:43", "image": "http://www.technewsworld.com/article_images/story_graphics_xlarge/xl-2016-election2016-1.jpg", "description": "Dirty tricks during political campaigns are nothing new, but the Internet and the proliferation of mobile devices have allowed tricksters to up their games a notch. It came to light last week, for example, that Donald Trump's campaign app was hoovering the address books on his supporters' phones. Trump's app wasn't doing anything illegal. It wasn't even trying to hide what it was doing.", "title": "Election Season Spawns Scams With Political Twist"},
{"url": "http://www.technewsworld.com/story/Nextdoor-Tackles-Racial-Profiling-at-Street-Level-83850.html", "timestamp": "2016-09-14 18:56:43", "image": "http://www.technewsworld.com/article_images/story_graphics_xlarge/xl-2014-nextdoor-1.jpg", "description": "Nextdoor last week rolled out to all 110,000 of its neighborhoods a new form-based process for making crime and safety reports. Implementation of the tool reduced incidents of racial profiling by 75 percent in areas where it was tested, according to CEO Nirav Tolia. Some Nextdoor members had begun using the site to post problematic messages targeting racial minorities.", "title": "Nextdoor Tackles Racial Profiling at Street Level"},
{"url": "http://www.technewsworld.com/story/Snazzier-Fitbits-Sport-Beefed-Up-Feature-Sets-83849.html", "timestamp": "2016-09-14 18:56:43", "image": "http://www.technewsworld.com/article_images/story_graphics_xlarge/xl-2016-fitbit-charge2-1.jpg", "description": "Fitbit on Monday announced two new fitness trackers with sleeker looks, more durable construction and greater data-gathering capabilities. The Fitbit Charge 2, priced at $149.95, features continuous heart-rate tracking. It uses the data to generate a cardio fitness score and provides guidance for improving it over time. The Charge 2 displays real-time exercise stats.", "title": "Snazzier Fitbits Sport Beefed-Up Feature Sets"},
{"url": "http://www.technewsworld.com/story/StandWithLeslie-and-Obliterate-Internet-Trolls-83843.html", "timestamp": "2016-09-14 18:56:43", "image": "http://www.technewsworld.com/article_images/story_graphics_xlarge/xl-2016-internet-troll-1.jpg", "description": "I think there's a legitimate argument for removing one category of folks from the gene pool, because they spend the little time they are given on Earth making other folks' lives miserable. Back when I was playing MMOs, some twisted folks -- known as \"griefers,\" would lie in wait to mug lower level characters and find creative ways to destroy the fun in a game, often eventually killing it.", "title": "#StandWithLeslie and Obliterate Internet Trolls"},
{"url": "http://www.technewsworld.com/story/Innocents-Exposed-as-WikiLeaks-Gushes-Information-83847.html", "timestamp": "2016-09-14 18:56:43", "image": "http://www.technewsworld.com/article_images/story_graphics_xlarge/xl-2016-online-privacy-1.jpg", "description": "WikiLeaks reportedly has leaked sensitive personal information belonging to hundreds of innocent individuals worldwide, including some residing in several highly repressive countries.\r\nThe organization has revealed private credit card data, medical information, personal addresses and other data of various individuals, including the identification as gay of a Saudi Arabian who had been arrested.", "title": "Innocents Exposed as WikiLeaks Gushes Information"}
]